{
    "Mit nevezünk egy kereső rendszer globális munkaterületének? (lehet több is jó)" : "Azt a memóriaterületet, amelyen a keresés eltárolja a megszerzett, és megőrzésre hasznosnak ítélt ismereteket.",
    "Melyek a hiperút tulajdonságai? (lehet több is jó)" : ["Csúcsaiból legfeljebb egyetlen hiperél indul", "Kezdőcsúcsából bármelyik csúcsába vezet hiperútbeli irányított út."],
    "Az alábbi algoritmusok közül melyek használnak módosítható stratégiát?" : "szélességi gráfkeresés",
    "Az alábbi módszerek közül melyekbe épült be visszalépéses keresés? (lehet több is jó)" : ["Mélységi gráfkeresésben",
    "Alfa-béta kiértékelő algoritmusban a kétszemélyes játékoknál."],
    "Mit reprezentál egy kétszemélyes játéknak egy állapota?" : "Egy állást és a soron következő játékost.",
    "Hogyan szokták az egyeneseket kódolni?" : "Úgy, hogy a kód darabjai az egyed egy-egy tulajdonságát mutassa.",
    "Hogyan nevezzük a gráfkeresések globális munkaterületén tárolt gráfot?" : "keresőgráf",
    "Mit nevezünk egy hiperút bejárásának?" : "Olyan sorozatot, amelynek elemei a hiperút csúcsaiból álló sorozatok.",
    "Az alábbiak közül melyik NEM modellfüggő vezérlési stratégia?" : "A legjobb csúcsot válasszuk a szomszédos csúcsok közül.",
    "A félév során tanult módszerek közül melyik NEM tekinthető útkereső algoritmusnak?" : "rezolúció",
    "Hogyan lehet megtudni, hogy kinek van nem-vesztő stratégiája egy három esélyes (győzelem,vereség,döntetlen) kimenetelű kétszemélyes játékban?) (lehet több is jó)" : ["A játékfa leveleit megcímkézzük annak a játékosnak a nevével (A vagy B), aki a levél csúccsal jelzett állásban nyerni fog, a döntetlen állásokhoz az X címkét írjuk. Szintről szintre felfelé haladva az Y játékos szintjén lévő csúcs, ha van Y cím gyereke akkor Y címkét kap, ha nincs, de van X címkéjű gyereke, akkor X címkét kap, különben a másik játékos nevét írjuk oda. A gyökér címkéje adja meg a választ.", "A minimax algoritmussal ha a teljes játékfára alkalmazzuk úgy, hogy az első játékos győztes állásaihoz +1-et, a vesztes állásaihoz -1-et rendelünk a döntetlen állásokhoz 0-t. Ha a gyökérbe lefuttatott érték +1 akkor az első játékosnak győztes stratégiája van, ha 0 akkor mindkettőnek nemvesztő stratégiája, ha -1 akkor második játékosnak van győztes stratégiája."],
    "Tekintsünk három eseményt (A, B, E), amelyiket egy valószínűség háló három különböző csúcsához írt valószínűségi változóinak segítségével fogalmazhatunk meg (E változók csúcsait röviden az A, B és E csúcsainak is hívhatjuk.) Mikor mondhatjuk, hogy az A és a B feltételesen független E-re nézve? (lehet több is jó)" : ["Ha A csúcsából E csúcsába, E csúcsából B csúcsába vezet irányított él, de A és B csúcsai között nem.", "Ha A és B csúcsaiba vezet irányított és sz E csúcsából, de A és B csúcsai között nem."],
    "Mi a feladata a vezérlési stratégiának a kereső rendszerekben? (itt csak egy mo van)" : "Kiválasztani a soron következő keresési szabályt.",
    "Melyik állítás NEM igaz a visszalépéses keresés második változatára az alábbiak közül? (csak egy mo van)" : ["Véges körmentes gráfokban mindig talál megoldást, ha van.", "Körmentes δ-gráfokon mindig talál megoldást, ha van."],
    "Az alábbiak közül melyik NEM utal a mesterséges intelligencia jelenlétére egy szoftverben?" : "A szoftver optimális megoldást talál a kitűzött problémához.",
    "Mire utal egy algoritmussal kapcsolatban a kombinatorikus robbanás fogalma?" : "Az algoritmus kezelhetetlenül nagy memóriát igényel és/vagy a futási ideje óriási.",
    "Mit várunk el egy útkereső algoritmustól?" : "Azt, hogy egy irányított gráfban egy adott csúcsból kiinduló megadott csúcsok valamelyikébe érkező irányított utat találjon meg.",
    "Hogyan definiáljuk az optimális költség fogalmát?" : ["Egy csúcsból csúcsok halmazába vezető utak költségeinek minimuma.", "Egy csúcsból egy másik csúcsba vezető utak költségeinek minimuma."],
    "Mely állítások igazak az alábbiak közül?1" : ["A Turing kritérium cáfolataként született meg a kínai szoba elmélet.", "A kínai szoba elmélet az MI szkeptikusok érveit erősíti."],
    "Mikor nevezhetünk egy feladatot útkeresési problémának?d" :  ["Amikor a megoldás egy irányított gráf egy útjának feleltethető meg.", "Amikor a feladat problématerének elemei ugyanazon csúcsból kiinduló irányított utak."],
    "Hogyan nyerhető ki egy útkeresési probléma megoldásakor kapott útból a feladat megoldása?" : ["Sokszor az út élei mutatják a feladat megoldásához szükséges lépéseket.", "Néha az út végpontja szimbolizálja a feladat egy megoldását."],
    "Mely állítások igazak egy 𝛿-gráfra?" : ["Csúcsaiból véges sok irányított él indul ki.", "Végtelen sok csúcsa lehet."],
    "Egy útkeresési feladat gráfreprezentációjához meg kell adni a …" : ["startcsúcsot","reprezentációs gráfot"],
    "Az alábbiak közül melyek tartoznak a Turing kritériumok közé?" : ["megszerzett ismeret tárolása","természetes nyelvű kommunikáció","automatikus következtetés"],
    "Állítsa párba: mely fogalmak kapcsolhatók egymáshoz!" : ["hatalmas problématér - kombinatorikus robbanás","kínai szoba elmélet - MI szkeptikusok","útkeresési feladat - probléma modell", "heurisztika - intuíció"],
    "Egy hiperút egy bejárása" : ["a hiperút összes hiperélét legalább egyszer érinti.", "a hiperút egy hiperélét legfeljebb annyiszor érinti, ahány közönséges irányított út vezet a hiperútban a hiperút kezdőcsúcsából a hiperél kezdőcsúcsába"],
    "Hogyan NEM csökkenthető egy állapottér modell bonyolultsága?" : "Csökkentjük a célállapotok számát.",
    "Mitől NEM függ egy reprezentációs gráf bonyolultsága?" : "A csúcsai be-fokának számától.",
    "Melyik NEM része a probléma dekompozíciós modellnek?" : "Az állapotok definiálása.",
    "Milyen egy dekompozíciós operátor?" : "Egy problémát több problémának a sorozatára képez le.",
    "Az alábbiak közül melyek NEM elemei az állapottér modellnek?" : ["állapotgráf","heurisztika"],
    "Mely állítások igazak az állapotgráfra az alábbiak közül?" : ["Csúcsai az állapotokat szimbolizálják."," Startcsúcsa a kezdőállapotot szimbolizálja.", "Élei a műveletek végrehajtásait szimbolizálják."],
    "Az alábbi feladat-modellezések közül melyeknél NEM egyezett meg a problématér a reprezentációs gráf startcsúcsból kivezető útjaival?" : ["n-királynő probléma", "integrál számítás"],
    "Melyik ok-okozati összefüggések igazak az alábbiak közül?" : ["Az állapotgráfbeli körök hossza és száma kihat a problématér bonyolultságára.","Az állapotgráf csúcsainak száma kihat a megoldó algoritmus hatékonyságára."],
    "Hogyan csökkenthető egy állapottér modellben a műveletek kiszámítási bonyolultsága?" : ["Szigorítjuk az állapotok invariáns állítását.","Az állapotokat extra információval egészítjük ki."],
    "Mely fogalmak kapcsolhatók egymáshoz?" : ["dekompozíciós operátor - hiperél","állapot - csúcs","művelet - irányított él", "dekompozíciós folyamat - hiperút"],
    "Melyek a feltételei a visszafelé haladó keresésnek?" : "A reprezentációs gráf kétirányú éleket tartalmazzon és legyen ismert valamelyik célállapot.",
    "Mi célt szolgál a probléma-redukciós operátor?" : "Az állapottér modell egy műveletére megadja, hogy a művelet segítségével mely állapotokból lehet eljutni adott állapotok egyikébe.",
    "Az alábbi módszerek közül melyiknél változhat futás közben a globális munkaterület mérete?" : "Tabu keresésnél.",
    "Melyik állítás NEM igaz a lokális keresésekre az alábbiak közül?" : ["Ezek mohó stratégiájú algoritmusok.","Csak egy lokálisan legjobb megoldást képes megtalálni."],
    "Tekinthető-e a hegymászó módszer a tabu keresés speciális változatának?" : ["Igen, amennyiben a hegymászó módszer tulajdonképpen egy egyelemű tabu halmazt használ, amely az előző aktuális csúcsot tárolja csak.","Nem, amennyiben a hegymászó módszer nem tárolja el az eddig megtalált legjobb kiértékelő függvényértékű csúcsot."],
    "Hány helyen használ a szimulált hűtés algoritmusa véletlenített módszert?" : "Kettő. A következő csúcs kiválasztásához, illetve annak elfogadásához.",
    "Mely állítások igazak az alábbiak közül?2" : ["A heurisztika egyszerre csökkentheti az algoritmus memória igényét és a futási idejét.", " A heurisztikát a feladatot megoldó algoritmusba közvetlenül építjük be."],
    "Melyek az alábbiak közül a tabu keresés hátrányai?" : ["Zsákutcába érve a keresés megáll.", "A tabu halmaz méretét csak kísérletezéssel lehet beállítani."],
    "Mely állítások NEM igazak a lokális keresésre az alábbiak közül?" : ["Körmentes gráfokban nem akad el.", "Talál megoldást, ha van megoldás."],
    "Melyek az alábbiak közül a hegymászó módszer hátrányai?" : ["Nem garantál optimális megoldást.", "Zsákutcába érve a keresés megáll.", "Körök mentén végtelen működésbe kezdhet."],
    "Hogyan hat a heurisztika információ tartalma egy kereső rendszer futási idejére?" : ["Nagyobb információ tartalom mellett a lépések száma csökkenhet.", "Minél kisebb az információ tartalma, annál gyorsabban tud új lépést választani.", "Nagyobb információ tartalom mellett egy lépés futási ideje nő."],
    "Mely algoritmusok születtek a hegymászó módszer zsákutcában való beragadásának elkerülésére?" : ["Véletlen újraindított keresés (random restart search)", "Szimulált hűtés algoritmusa", "Lokális nyaláb keresés (local beam search)"],
    "Mi a lokális keresések általános vezérlési stratégiája?" : "Az aktuális csúcs(ok) környezetéből válasszunk egy (vagy több) viszonylag jó csúcsot!",
    "A tabu keresésnél használt kiértékelő függvény, amellyel össze tudjuk hasonlítani az aktuális csúcs gyerekeit, heurisztikus stratégiának számít?" : "Igen, ez a függvény a konkrét feladatból származik.",
    "Mely fogalmak kapcsolhatók egymáshoz a visszalépéses keresés esetén?" : ["globális munkaterület - irányított út", "keresési szabály - visszalépés", "másodlagos vezérlési stratégia - sorrendi szabály", "második változat - mélységi korlát gyelés"],
    "Mit tartalmaz a visszalépéses keresések globális munkaterülete?" : "A startcsúcsból kiinduló egyik utat és annak csúcsaiból kivezető még nem vizsgált éleket.",
    "Melyek a visszalépéses keresés keresési szabályai?" : "A nyilvántartott út végcsúcsából kivezető egyik él hozzávétele az úthoz, illetve az út utolsó élének elvétele.",
    "Mi a visszalépéses keresés általános vezérlési stratégiája?" : "A visszalépés szabályát csak a legvégső esetben válasszuk.",
    "Melyik állítás NEM igaz a visszalépéses keresés második változatára az alábbiak közül?" : "A körfigyelés elhagyása mindenképpen gyorsítja a megoldás megtalálását.",
    "Melyek az alábbiak közül a visszalépéses keresés hátrányai?" : ["Ugyanazt a részgráfot többször is bejárja.", "Kezdetben hozott rossz döntést csak sok visszalépés árán korrigálja."],
    "Képzelje maga elé a 4-királynő probléma 2. állapottér modelljének állapotfáját. (Minden csúcsból négy él vezet ki.) Hány startcsúcsból kivezető utat vizsgál meg ebben a visszalépéses keresés második változata, ha a mélységi korlát 2?" : "21",
    "Mely állítások igazak a visszalépéses keresés második változatára az alábbiak közül?" : ["Minden 𝛿-gráfban terminál.", "Minden 𝛿-gráfban talál megoldást, ha annak hossza rövidebb, mint a mélységi korlát."],
    "Mely állítások NEM igazak a visszalépéses keresés második változatára az alábbiak közül?" : ["A körfigyelés önmagában is elég ahhoz, hogy garantáltan termináljon.", "Képes megtalálni a legrövidebb megoldást, ha van."],
    "Melyek az alábbiak közül a visszalépéses keresés előnyei?" : ["Ha van (mélységi korálton belül) megoldása, akkor talál egyet.","Mindig terminál.","Kicsi a memória igénye."],
    "Mely állítások NEM igazak az alábbiak közül?" : ["A sorrendi szabály egy heurisztikus vezérlési stratégia.", "Vágó szabály nem alkalmazható sorrendi szabályokkal együtt"],
    "Képzelje maga elé a Hanoi tornyai probléma állapotgráfját három korong esetén. A startcsúcsból kivezető utak közül hányat vizsgál meg a visszalépéses keresés második változata, ha a mélységi korlát 3?" : "15",
    "Mit tartalmaz a gráfkeresés globális munkaterülete?" : "A startcsúcsból kiinduló eddig felfedezett összes utat a nyílt csúcsokkal együtt.",
    "Melyek a gráfkeresés keresési szabályai?" : "A nyílt csúcsok kiterjesztései.",
    "Mi a gráfkeresés általános vezérlési stratégiája?" : "Minden lépésben a legígéretesebb nyílt csúcsot választja kiterjesztésre.",
    "Mely csúcsokat nevezzük a gráfkereséseknél nyílt csúcsoknak?" : "A keresőgráf azon csúcsait, amelyek gyermekeit még nem, vagy nem eléggé jól ismerjük, ennél fogva kiterjesztésre várnak.",
    "Mit mutat a gráfkereséseknél a szülőre visszamutató pointerfüggvény (𝜋)?" : "A keresőgráfbeli csúcsok egyik szülőjét.",
    "Mit mutat a gráfkereséseknél a költségfüggvény (g)?" : "A startcsúcsból a keresőgráfbeli csúcsokhoz, a keresőgráfban vezető egyik út költségét.",
    "Mikor nevezünk egy kiértékelő függvényt csökkenőnek?" : "Ha egy csúcs függvényértéke soha nem nő, viszont mindig csökken valahányszor olcsóbb odavezető utat találunk hozzá",
    "Hogyan lehet a keresőgráf korrektségét fenn tartani?" : ["Minden kiterjesztés után bejárjuk a kiterjesztéssel elért gyerekcsúcsok leszármazottait (ha vannak), és kijavítjuk azok korrektségét.", "Olyan kiértékelő függvényt használunk, amely kizárja, hogy egy már korábban kiterjesztett csúcshoz minden addiginál olcsóbb odavezető utat találjunk a startcsúcsból."],
    "Mikor mondjuk a keresőgráf egyik csúcsára, hogy korrekt?" : ["Ha a szülőre visszamutató pointerek a keresőgráfra nézve optimális utat jelölnek ki hozzá a startcsúcsból, és ennek az útnak a költségét mutatja a költségfüggvény.", " Ha optimális és konzisztens."],
    "Mely állítások igazak az alábbiak közül a gráfkeresés általános algoritmusára?" : ["Véges 𝛿-gráfban mindig terminál.", "Egy csúcsot legfeljebb véges sokszor terjeszt ki még végtelen nagy 𝛿-gráfokesetén is.", "Véges 𝛿-gráfban talál megoldást, ha van."],
    "Mely állítások NEM igazak az alábbiak közül a gráfkeresés általános algoritmusára?" : ["Körmentes 𝛿-gráfban talál megoldást, ha van.", "𝛿-gráfban mindig terminál."],
    "Mely fogalmak kapcsolhatók egymáshoz a gráfkereséseknél?1" : ["globális munkaterület - keresőgráf", "keresési szabály - kiterjesztés", "pointerfüggvény - szülőcsúcs", "csökkenő kiértékelő függvény - korrektség"],
    "Lehet-e sorrendi heurisztika egy nem-informált gráfkeresés másodlagos vezérlési stratégiájában?" : "Igen.",
    "Mit jelent a gráfkereséseknél a megengedhetőség fogalma?" : "Olyan heurisztikus függvényt, amely alulról becsüli egy reprezentációs gráfban a csúcsokból a célba vezető optimális út költségét.",
    "Melyik állítás NEM igaz az azonosan nulla függvényről?" : "Nem válaszható kiértékelő függvénynek.",
    "Melyik gráfkereső algoritmust nevezzük A* algoritmusnak?" : "Amelyik kiértékelő függvénye g+h alakú, ahol h nem-negatív és megengedhető.",
    "Mi az alábbiak közül az A algoritmus tulajdonsága?" : "𝛿-gráfban megengedhető heurisztikával optimális megoldást talál, ha van.",
    "Mely állítás NEM igaz a következetes (A^c ) algoritmusra?" : "A kiterjesztéseinek száma akár a kiterjesztett csúcsok száma mínusz egynek a kettő hatványa is lehet.",
    "Mennyi a B algoritmus kiterjesztéseinek száma legrosszabb esetben, ha a kiterjesztett csúcsok száma k?" : "½ k^2",
    "Mikor mondunk egy A* algoritmust jobban informáltnak egy másiknál?" : "Ha a heurisztikus függvényének értéke a nem célcsúcsokban kisebb, mint a másik algoritmus heurisztikus függvényének értéke.",
    "Mikor mondjuk a gráfkereséseknél egy heurisztikus függvényről azt, hogy monoton megszorításos?" : "Ha bármelyik él költsége nagyobb-egyenlő, mint az a különség, amit úgy kapunk, hogy az él kezdőcsúcsának függvényértékéből levonjuk a végcsúcsának függvényértékét.",
    "Melyik állítás igaz az egyenletes gráfkeresésre?" : ["Optimális megoldást talál, ha van.", "Egy már kiterjesztett csúcshoz soha nem talál minden addiginál olcsóbb utat."],
    "Az alábbiak közül melyek a megengedhető gráfkereső algoritmusok?" : ["A algoritmus", "B algoritmus", "Egyenletes gráfkeresés", "A** algoritmus"],
    "Mely fogalmak kapcsolhatók egymáshoz a gráfkereséseknél?2" : ["mélységi gráfkeresés - nem-informált gráfkeresés", "A* algoritmus - optimális megoldás", "B algoritmus - Martelli", "memória igény - zárt csúcsok száma"],
    "A kurzuson speciális kétszemélyes játékokkal foglalkoztunk. Az alábbiak közül melyik tulajdonság NEM volt érvényes ezekre?" : "egyik játékosnak biztos van győztes stratégiája",
    "Hogyan modellezzük a kétszemélyes játékokat?" : "Állapottér modellel.",
    "Mi a nyerő stratégiája egy játékosnak egy kétszemélyes játékban?" : "Azon győztes végállásba vezető játszmáinak összessége, amelyek közül valamelyiket biztosan végig tudja játszani, ha nem hibázik.",
    "Melyik állítás igaz az alábbiak közül egy játékos nyerő stratégiára?" : "A játékfából a játékos szempontjából készített ÉS/VAGY fában egy olyan hiperút, amelyik a startcsúcsból csupa, a játékos számára nyerő végállásba vezet.",
    "Hogyan lehet megtudni, hogy kinek van győztes stratégiája egy két kimenetelű kétszemélyes játékban?" : ["Úgy, hogy a minimax algoritmust alkalmazzuk a teljes játékfára úgy, hogy az első játékos győztes állásaihoz +1-et, a vesztes állásaihoz -1-et rendelünk. Ha a gyökérbe felfuttatott érték +1, akkor az első játékosnak van győztes stratégiája, egyébként a másodiknak.", "A játékfa leveleit megcímkézzük annak a játékosnak a nevével, aki a levélcsúccsal jelzett állásban nyerni fog. Szintről szintre felfelé haladva az Y játékos szintjén levő csúcs, ha van Y címkéjű gyereke, akkor Y címkét kap; különben a másik játékos nevét írjuk oda. A gyökér címkéje adja meg a választ."],
    "Mikor következik be vágás az alfa-béta algoritmus működése során?" : "Ha az aktuális út egy alfa értéke nagyobb vagy egyenlő az út egy béta értékénél.",
    "Mi az a nyugalmi teszt?" : ["Váltakozó mélységű keresésnél a részfa felépítéséhez használt feltétel.", "Egy szülőcsúcs és egy gyerekének kiértékelő függvényértékei különbségét vizsgáló teszt."],
    "Mely állítások igazak az alábbiak közül a játékfákra?" : ["Ágai a lehetséges játszmákat szimbolizálják.", "Csúcsai a játék állásait szimbolizálják.", "Szintjei a soron következő játékost szimbolizálják."],
    "Melyek az alábbiak közül a minimax algoritmusnak a lépései?" : ["Kiértékeljük a felépített fa leveleit", "A saját szintjeink csúcsaihoz a gyerekeik értékeinek maximumát írjuk."],
    "Az alábbi részleges játékfa kiértékelő módszerek közül melyik ad a minimaxszal azonos eredményt?" : ["negamax algoritmus", "alfa-béta algoritmus"],
    "Mi a játékfa?" : ["A kétszemélyes játék modelljének állapotgráfjából kialakított irányított fa.", "Az összes játszmát irányított útként megjelenítő irányított fa."],
    "Mely fogalmak kapcsolhatók egymáshoz a részleges játékfa-kiértékeléseknél?" : ["negamax algoritmus könnyebb implementáció", "(m,n) átlagoló kiértékelés - kiértékelő függvény tévedés", "váltakozó mélységű kiértékelés - megbízhatóbb kiértékelés", "alfa-béta algoritmus hatákonyabb módszer"],
    "Milyen az általános vezérlési stratégiája az evolúviós algoritmusoknak?" : "nem-módosítható",
    "Mit tárol az evolúciós algoritmus a globális munkaterületén?" : "A populációt.",
    "Melyik NEM evolúciós operátor az alábbiak közül?" : "Egy egyed kódolása.",
    "Hogyan szokták az egyedeket kódolni?" : "Úgy, hogy a kód darabjai az egyed egy-egy tulajdonságát mutassa.",
    "Hol épülhet véletlenített módszer az evolúciós algoritmusba?" : "Csak a kezdeti populáció kialakításában és mind a négy evolúciós operátorban.",
    "Hol van szerepe a kiválasztásnak az evolúciós algoritmusban?" : ["Ez az első lépése az evolúciós ciklusnak.", "A populáció lecserélendő egyedeinek előállításában.", "A rekombinációhoz szükséges szülő egyedek előállításában és az új populáció kialakításában."],
    "Mi a lényege a jó kiválasztási módszernek az evolúciós algoritmusokban?" : "A rátermett egyedeket nagyobb valószínűséggel választja ki, de ad esélyt a kevésbé rátermettek kiválasztására is.",
    "Mi a kapcsolat a keresztezés és a rekombináció között?" : "A keresztezések speciális rekombinációk.",
    "Melyek lehetnek a feltételei az evolúciós algoritmus leállásának?" : ["A populáció összesített fittneszértéke már egy ideje nem változik.", "Célegyed megjelenése a populációban."],
    "Mely keresztezési módszerek őrzik meg permutáció tulajdonságot?" : ["Parciálisan illesztett keresztezés.", "Ciklikus keresztezés."],
    "Az alábbiak közül, melyek alkalmas módszerek a permutáció tulajdonságot megőrző mutációra?" : ["Kód egy szakaszának átrendezése.", "Kód két véletlen választott elemének cseréje."],
    "Mely fogalmak kapcsolhatók egymáshoz az evolúciós algoritmusoknál?" : ["kétpontos keresztezés - parciális illesztett keresztezés", "kiválasztás - fittnesz függvény", "egyed - kód", "stratégiai paraméter - populáció mérete"],
    "Mi az a rezolúciós gráf?" : "Az összes klóz előállítását bemutató gráf.",
    "Melyek a p || q és a !p || !q rezolvensei?" : "p || !p és q || !q",
    "Mi a globális munkaterülete a rezolúciónak?" : "A kiinduló és az eddig előállított klózok halmaza.",
    "Mi a keresési szabálya a rezolúciónak?" : "A rezolvens képzés.",
    "Melyik az alábbiak közül a visszafelé haladó szabályalapú reprezentáció jellemzője?" : "A szabályok W→L alakúak, ahol W egy ÉS/VAGY formula, L egy literál, és minden változó univerzálisan kvantált.",
    "Melyik az alábbiak közül az előrefelé haladó szabályalapú reprezentáció jellemzője?" : "A szabályok L→W alakúak, ahol W egy ÉS/VAGY formula, L egy literál, és minden változó univerzálisan kvantált.",
    "Hogyan kell a rezolúciót válaszadásra felhasználni?" : "A választ egy egzisztenciálisan kvantált változóval kell megjeleníteni a célállításban.",
    "Mi következik abból, hogy a rezolúció módszere helyes?" : ["Ha elakad (nem tud újabb klózt előállítani), akkor a kiinduló klózhalmaz kielégíthető.", "Ha üres klózzal terminál, akkor a kiinduló klózhalmaz kielégíthetetlen."],
    "Mi következik abból, hogy a rezolúció módszere teljes?" : ["Ha a kiinduló klózhalmaz kielégíthető, akkor nem állítja elő az üres klózt.", "Ha a kiinduló klózhalmaz kielégíthetetlen, akkor levezethető az üres klóz."],
    "Melyek az alábbiak közül a rezolúció reprezentációs gráfjának különös tulajdonságai?" : ["Ha a stratcsúcsból vezet út célcsúcsba, akkor mindegyik startcsúcsból elérhető csúcsból is vezet célcsúcsba út.", "Nincs benne kör."],
    "Melyek lehetnek az alábbiak közül a rezolúció modellfüggő vágó stratégiái?" : ["Minden rezolúciós lépésben az egyik szülőklóz az utoljára előállított klóz legyen.", "Minden rezolúciós lépésben az egyik szülőklóz egyetlen literálból álljon."],
    "Melyek az alábbiak közül a rezolúció modellfüggő sorrendi stratégiái?" : ["Mindig azt a klózpárt rezolváljuk, amelyekben a literálok száma a legkevesebb.", "Soroljuk be szintekre a rezolúciós gráf klózait. Nulladik szinten a kiinduló klózok, az i+1-dik szinten azok, amelyek egyik szülője az i-dik szinten van, a másik szülő az első i szint valamelyikén. Állítsuk elő szintenként a klózokat."],
    "Hogyan számoljuk az A esemény valószínűségét feltéve, hogy B esemény - amely valószínűsége nagyobb, mint nulla - bekövetkezik?" : "P(A|B) = P(A,B) / P(B)",
    "Mikor mondjuk, hogy A és B események feltételesen függetlenek E eseményre nézve?" : "P(AB|E) = P(A|E) P(B|E)",
    "Az alábbiak közül melyik egy Bayes tétel?" : "P(A|B) = P(B|A) P(A) / P(B)",
    "Az alábbiak közül melyik NEM igényel bizonytalanság kezelést?" : "Axiómákból kiinduló logikai következtetés.",
    "Milyen gráf a valószínűségi háló?" : "Véges körmentes irányított gráf.",
    "Mit mutat meg a valószínűségi háló feltételes valószínűségi táblája?" : "Azt, hogy egy csúcs valószínűségi változója milyen valószínűséggel vesz fel egy adott értéket feltéve, hogy a szülő csúcsok valószínűségi változói adott értékűek.",
    "Mit jelent a normalizálás technikája?" : ["Adott kifejezések olyan együtthatóval történő szorzását, hogy ezáltal az összegük 1 legyen.", "Adott összegű kifejezések közös együtthatójának kiszámolását."],
    "Mit jelent az, hogy egy valószínűsági háló egyszeresen kötött?" : "Azt, hogy a háló egy fa-gráf",
    "Az alábbiak közül melyek igazak a valószínűségi hálókra?" : ["Irányított élei a válószínűségi változók közötti közvetlen ok-okozati összefüggéseket mutatják.", "Csúcsai egy adott tárgykör valószínűségi változóit reprezentálják."],
    "Hogyan javítható a valószínűségi hálóban való számítás hatékonysága, ha a háló nem fa-gráf?" : ["Csúcsok összevonásával fa-gráffá alakítjuk a valószínűségi hálót.", "Csúcsok elhagyásával több fa-gráfokra bontjuk a valószínűségi hálót.", "A valószínűségi hálót példák generálására használjuk, amelyekből relatív gyakoriságot számolunk."],
    "Milyen heurisztikus bizonytalanságkezelő technikákról hallott?" : ["Fuzzy következtetés.", "MYCIN szakértő rendszer következtetése."],
    "Mely fogalmak kapcsolhatók egymáshoz a bizonytalanság kezelésnél?" : ["fa-gráf - csúcsok összevonása", "heurisztikus módszer - MYCIN", "bizonytalan következmény - feltételes valószínűség", "valószínűségi háló - véges körmentes gráf"],
    "Mit jelent az, hogy egy tanulás felügyelt?" : "A tanító minták elvárt kimenetét is felhasználja a tanulási folyamat.",
    "Mit jelent az, hogy egy tanulás felügyelet nélküli?" : "A tanulásnak nincs szüksége a tanító minták elvárt kimenetére.",
    "Mit jelent a zaj a tanító minták esetén?" : "Amikor azonos attribútumokkal rendelkező minták eltérő elvárt kimenetekkel rendelkeznek.",
    "Különböző tanító minták halmazának mikor a legkisebb az információ (entrópia) tartalma a döntési fáknál?" : "Ha mind azonos kimeneti értékkel rendelkezik.",
    "Hogyan értékelünk ki a döntési fa építése során egy levélcsúcsot akkor, ha nem tartoznak hozzá tanító minták?" : "A szülőcsúcsához tartozó tanítóminták alapján.",
    "A döntési fa építése során az alábbiak közül milyen csúcsok fordulhatnak elő a fában?" : ["Kiértékeletlen levélcsúcsok.", "Kiértékelt levélcsúcsok.", "Attribútummal címkézett belső csúcsok."],
    "Mely állítások igazak a döntési fára?" : ["Egy csúcsból kivezető élei a csúcs attribútumának lehetséges értékeit szimbolizálják.", "Belső csúcsai egy-egy attribútumot reprezentálnak."],
    "Mely állítások igazak a döntési fa módszerére?" : ["A tanulási idő hosszú.", "A válaszadási idő rövid."],
    "Mely állítások igazak k-legközelebbi szomszéd módszerére?" : ["A megtanult paraméter a minták összessége.", "Egyszerű implementálni."],
    "Milyen felügyelt tanulási módszereket ismert meg a kurzuson?" : ["k-legközelebbi szomszéd módszere.", "Error backpropagation algoritmus.", "Véletlen erdő módszere."],
    "Hol jutott szerepe a véletlennek a véletlen erdő módszerében?" : ["Az erdő egy fájának felépítéséhez a minták attribútumai közül véletlen választott attribútumokat használ.", "Az erdő egy fájának felépítéséhez a minták véletlen választott részhalmazát használja."],
    "Mely fogalmak kapcsolhatók össze az alábbiak közül a gépi tanulás témakörében?" : ["felügyelt tanulás - tanító minták elvárt kimenetele", "kereszt entrópia - 2-es norma", "döntési fa - véletlen erdő", "k-közép módszer - osztályozási feladat"],
    "Az alábbiak közül melyik jellemzik a homogén többrétegű előrecsatolt hálózatot?" : ["Az i-dik réteg neuronjának kimenete csak az i+1-dik réteg neuronjának lehet bemeneti értéke.", "Az azonos réteghez tartozó neuronok között nincs közvetlen kapcsolat."],
    "Mit jelent az input vektorizálása?" : "Egy inputot a jellemzői (attribútumai) segítségével egy számsorozattal ábrázolunk.",
    "Jellemezze a szigmoid kimeneti függvényt!" : "Folytonos, mindenhol deriválható, szigorúan monoton növekedő, ]0,1[ intervallumba képző függvény.",
    "Az alábbiak közül melyik hálózatnak NEM lehet több rétegű topológiája?" : "Hopfield neurális hálózat.",
    "Mi a delta tanulási szabály?" : "Egy súly megváltoztatása a súlyhoz tartozó bemeneti értéknek, és a súlyt tartalmazó neuron számított és várt kimeneti értékei különbségének szorzatától függ.",
    "Mire alkalmazzák a lineárisan szeparálható kifejezést?" : "Azokra a feladatokra, amelyek lehetséges bemeneti érték n-esei egy hipersíkkal elválaszthatók aszerint, hogy az ezekre elvárt válasz A vagy B.",
    "A mesterséges neuron hálózatokra felügyelt vagy felügyelet nélküli tanulási módszer alkalmazható?" : "Mindkettő.",
    "Hogyan lehet Rosenblatt-féle perceptronok felhasználásával koordinátapárokat úgy osztályozni, hogy megmondjuk melyek esnek bele egy megadott háromszögbe, és melyek nem?" : "Olyan kétrétegű előrecsatolt hálózattal, ahol az első rétegben három, a második rétegben egy neuron van.",
    "A mesterséges neuronhálózatot egy olyan paraméteres függvénynek tekinthetjük, amellyel a megoldandó problémát reprezentáló leképezést közelítjük. Melyek ebben a paraméterek?" : "A neuronok súlytényzői.",
    "Mit értünk a hiba-visszaterjesztés (error-backpropagation) módszere alatt?" : "Azt, amikor egy többrétegű előrecsatolt hálózat kimeneti rétegének számított és várt outputjai alapján határozzuk meg, hogy hogyan kell a hálóbeli neuronok súlyait változtatni.",
    "Mit értünk a Hopfield modell konfigurációs terén?" : [" A neuronok kimeneteinek összességét.", "A neuronok által felvett állapotok összességét."],
    "Az alábbiak közül mely állítások igazak a mesterséges neuronhálózatokra?" : ["A tanulási idő hosszú.", "A válaszadási idő rövid."]
}